In [1]:
import pandas as pd

titanic_gender = pd.read_csv('Desktop/EDA_Learning_Journey/titanic/gender_submission.csv')
titanic_test = pd.read_csv('Desktop/EDA_Learning_Journey/titanic/test.csv')
titanic_train = pd.read_csv('Desktop/EDA_Learning_Journey/titanic/train.csv')

In [3]:
titanic_gender.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [5]:
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
Survived = titanic_train.Fare[titanic_train.Survived == 1]
Survived.head()

1    71.2833
2     7.9250
3    53.1000
8    11.1333
9    30.0708
Name: Fare, dtype: float64

In [18]:
Dies = titanic_train.Fare[titanic_train.Survived == 0]
Dies.head()

0     7.2500
4     8.0500
5     8.4583
6    51.8625
7    21.0750
Name: Fare, dtype: float64

In [28]:
import numpy as np

In [30]:
survive_mean = np.mean(Survived)
survive_mean

48.39540760233918

In [34]:
died_mean = np.mean(Dies)
died_mean

22.117886885245902

In [36]:
diff_mean = survive_mean-died_mean
diff_mean

26.27752071709328

In [38]:
survive_med= np.median(Survived)
survive_med

26.0

In [40]:
died_med = np.median(Dies)
died_med

10.5

In [42]:
diff_med = survive_med-died_med
diff_med

15.5